"AlertSomePercentTitle" = "%d%% Remaining"; // 90% Remaining
"AlertOnePercentTitle" = "Your Mac is about to Power Down";
"AlertChargingTitle" = "Charging...";
"AlertChargingStoppedTitle" = "Charger Removed";
"AlertChargingCompleteTitle" = "Charging Complete";
"AlertOverheatingTitle" = "Overheating";
"AlertLimitedTitle" = "Not Enough Battery...";
"AlertDeviceConnectedTitle" = "Connected"; //'Joe's Headphones' Connected
"AlertDeviceDisconnectedTitle" = "Disconnected"; //'Joe's Headphones' Disconnected
"AlertDeviceCalculatingTitle" = "Calculating...";

"AlertEstimateSummary" = "**%@** until empty"; // 1 hour, 32 minutes until empty
"AlertPercentSummary" = "Time to grab the cable!";
"AlertStartedChargeSummary" = "Fully charged at **%@**."; // Fully charged at 2:32pm
"AlertChargedSummary" = "Your battery is fully charged.";
"AlertOverheatingSummary" = "High temperatures can deplete your battery more quickly and cause long-term damage.";
"AlertLimitedSummary" = "Your battery might be insufficient for the event '%@'.";

"TimestampHourFullAlertDeviceUnknownTitleLabel_Plural" = "%d hours";
"TimestampHourFullAlertDeviceUnknownTitleLabel_Single" = "%d hour";
"TimestampHourFullLabel_Single" = "%d hour";
"TimestampHourFullLabel_Plural" = "%d hours";
"TimestampMinuteFullLabel_Plural" = "%d minutes";
"TimestampMinuteFullLabel_Single" = "%d minute";
"TimestampDaysFullLabel_Plural" = "%d days";
"TimestampDaysFullLabel_Single" = "%d day";

"TimestampHourAbbriviatedLabel" = "h";
"TimestampMinuteAbbriviatedLabel" = "m";
"TimestampDayAbbriviatedLabel" = "d";
"TimestampNeverLabel" = "Never";
"TimestampNowLabel" = "A Few Moments Ago";

"SettingsWebsiteLabel" = "Support Development";
"SettingsQuitLabel" = "Quit";
"SettingsPinnedLabel" = "Pin to Screen";
"SettingsRateLabel" = "Rate BatteryBoi";
"SettingsEfficiencyLabel" = "Low Power";
"SettingsCheckUpdatesLabel" = "Check for Updates";
"SettingsNewUpdateLabel" = "Install New Update";
"SettingsDisplayLabel" = "Display";
"SettingsDisplayCycleLabel" = "Cycle Count";
"SettingsDisplayVoltageLabel" = "Voltage";
"SettingsDisplayPercentLabel" = "Percentage";
"SettingsDisplayTempratureLabel" = "Temprature";
"SettingsDisplayEstimateLabel" = "Time";
"SettingsDisplayNoneLabel" = "Empty";
"SettingsDisplayHiddenLabel" = "Hidden";
"SettingsProgressDynamicLabel" = "Show Dynamic Progress";
"SettingsProgressFullLabel" = "Show Static Full State";
"SettingsProgressEmptyLabel" = "Show Static Empty State";

"SettingsAboutLabel" = "About";
"SettingsCustomizationLabel" = "Customisation";
"SettingsSoundEffectsLabel" = "Sound Effects";
"SettingsNotificationsLabel" = "Notifications";
"SettingsPrereleasesLabel" = "Beta Releases";
"SettingsAnalyticsLabel" = "System Analytics";

"SettingsCustomizationMenuLabel" = "Menu Bar Icon";
"SettingsCustomizationThemeDarkLabel" = "Dark";
"SettingsCustomizationThemeLightLabel" = "Light";
"SettingsCustomizationThemeSystemLabel" = "System";
"SettingsCustomizationThemeTitle" = "Appearance";

"UpdateStatusCheckingLabel" = "Checking for Updates...";
"UpdateStatusIdleLabel" = "Last Checked: %@"; // Last Checked: 4 hours ago
"UpdateStatusEmptyLabel" = "No Updates Available";
"UpdateStatusNewLabel" = "New Update Available!";

"PermissionsDisabledLabel" = "Disabled";
"PermissionsRestrictedLabel" = "Restricted";
"PermissionsDeniedLabel" = "Denied (by User)";
"PermissionsUndeterminedLabel" = "Undetermined";
"PermissionsAllowedLabel" = "Allowed";
"PermissionsEnabledLabel" = "Enabled";
"PermissionsBlockedLabel" = "Blocked";
"PermissionsDisabledLabel" = "Disabled";
"PermissionsUnavailableLabel" = "Unavailable";
"PermissionsUnknownLabel" = "[Stares Blankly]";
"PermissionsErrorLabel" = "Internal Error (%@)";
"PermissionsYesLabel" = "Yes";
"PermissionsNoLabel" = "No";

"BluetoothDeviceHeadphonesLabel" = "Headphones";
"BluetoothDeviceMouseLabel" = "Mouse";
"BluetoothDeviceGamepadLabel" = "Gaming Controller";
"BluetoothDeviceSpeakerLabel" = "Speaker";
"BluetoothDeviceKeyboardLabel" = "Keyboard";
"BluetoothDeviceOtherLabel" = "Other";
"BluetoothConnectLabel" = "Connect";
"BluetoothDisconnectLabel" = "Disconnect";
"BluetoothDisconnectedLabel" = "Not Paired";
"BluetoothDistanceProximateLabel" = "In Proximity";
"BluetoothDistanceNearLabel" = "Nearby";
"BluetoothDistanceFarLabel" = "Far Away";
"BluetoothInvalidLabel" = "No Battery Information";

"OnboardingIntroTitle" = "Welcome to BatteryBoi";
"OnboardingIntroSubtitle" = "The most advanced battery utility for your Mac and connected devices.";
"OnboardingIntroButton" = "Get Started";

"OnboardingBluetoothTitle" = "Bluetooth Access";
"OnboardingBluetoothSubtitle" = "BatteryBoi needs Bluetooth access to monitor the battery levels of your mouse, keyboard, and other peripherals.";
"OnboardingBluetoothButton" = "Grant Access";

"OnboardingCloudTitle" = "iCloud Sync";
"OnboardingCloudSubtitle" = "Keep your battery levels in sync across all your Apple devices using iCloud.";
"OnboardingCloudButton" = "Enable iCloud";

"OnboardingMacTitle" = "Mac App (Optional)";
"OnboardingMacDetectedSubtitle" = "✓ Mac detected! You have access to Bluetooth devices, AirPods, and live Mac battery updates.";
"OnboardingMacMissingSubtitle" = "Install BatteryBoi on your Mac to track Bluetooth devices, AirPods, and Mac battery. Without it, you'll only see this device's battery.";
"OnboardingMacButton" = "Continue";

"OnboardingProcessTitle" = "Helper Tool";
"OnboardingProcessSubtitle" = "BatteryBoi requires a small helper tool to accurately read system power statistics.";
"OnboardingProcessButton" = "Install Helper";

"OnboardingLoginTitle" = "Launch at Login";
"OnboardingLoginSubtitle" = "Would you like BatteryBoi to start automatically when you log in?";
"OnboardingLoginPrimaryButton" = "Launch at Login";
"OnboardingLoginSecondaryButton" = "Not Now";

"OnboardingNoBatteryTitle" = "No Internal Battery";
"OnboardingNoBatterySubtitle" = "It looks like your Mac doesn't have an internal battery. BatteryBoi can still monitor your connected Bluetooth devices!";
"OnboardingNoBatteryButton" = "Continue";

"OnboardingHideIconTitle" = "Hide Default Battery Icon";
"OnboardingHideIconSubtitle" = "You can hide the default battery icon by going to System Preferences > Control Center > Battery > Show in Menu Bar";
"OnboardingHideIconButton" = "Got It";

"OnboardingNotificationsTitle" = "Notifications";
"OnboardingNotificationsSubtitle" = "Get alerted when your devices are low on battery or have finished charging.";
"OnboardingNotificationsButton" = "Enable Notifications";

"OnboardingMacOSTitle" = "BatteryBoi for Mac";
"OnboardingMacOSSubtitle" = "Download BatteryBoi for your Mac to sync battery levels across all your devices.";
"OnboardingMacOSButton" = "Learn More";

"OnboardingIOSTitle" = "BatteryBoi for iOS";
"OnboardingIOSSubtitle" = "Download BatteryBoi for your iPhone or iPad to track your devices on the go.";
"OnboardingIOSButton" = "Learn More";

"OnboardingCompleteLabel" = "All set! BatteryBoi is ready to go.";

"OnboardingCloudSecondaryButton" = "Skip for Now";
"OnboardingBluetoothSecondaryButton" = "Skip for Now";
"OnboardingNotificationsSecondaryButton" = "Skip for Now";
"OnboardingProcessSecondaryButton" = "Skip for Now";
